In [1]:
import pandas as pd

In [3]:
data = pd.read_excel("excel1.xlsx")
data

  Unnamed: 0  maas   yas  departman
0       Atıl   100  40.0    yazılım
1     Zeynep   150  50.0      satış
2     Mehmet   200  30.0        NaN
3      Ahmet    50  10.0  pazarlama
4      Atlas   150   NaN     finans
5      Fatma   200  25.0      hukuk

In [5]:
doludegerdata =data.dropna() #nan olanları attı

In [6]:
doludegerdata

  Unnamed: 0  maas   yas  departman
0       Atıl   100  40.0    yazılım
1     Zeynep   150  50.0      satış
3      Ahmet    50  10.0  pazarlama
5      Fatma   200  25.0      hukuk

In [7]:
doludegerdata.to_excel("yenimaas.xlsx") #to_excel doludegerdatasını excele yazdık

In [ ]:
##read_csv
#to_csv